In [20]:
import pandas as pd
import numpy as np

In [5]:
pd.__version__

'2.2.1'

## Datatype of Pandas

1. DataFrame : 2D Table with rows and columns

2. Series : 1D array-like , can hold any data type such as integers, strings, floating-point numbers, and Python objects

### Creating DataFrame

In [17]:
data = {
    "name":["Bob","charlie","Madhu"],
    "age":[25, 30, 35]
}

df = pd.DataFrame(data)

In [16]:
df

      name  age
1      Bob   25
2  charlie   30
3    Madhu   35

In [25]:
data = [["Bob",25],["charlie",30],["Madhu",35]]

df = pd.DataFrame(data, columns = ["name","age"])

In [26]:
df

      name  age
0      Bob   25
1  charlie   30
2    Madhu   35

## Reading Data from Files

- `pd.read_csv(file_path, delimiter=',')`: Reads CSV (Comma Separated Value) file and returns a Pandas DataFrame
    - *file_path*: Path to csv file
    - *delimiter*: Symbol separating different columns (default=',')

.json / .txt / .xlxs / SQL

In [42]:
titanic_df = pd.read_csv('../../Titanic_data.csv', nrows = 10)

In [43]:
titanic_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [48]:
type(titanic_df)

pandas.core.frame.DataFrame

### Accessing Data

In [53]:
names = titanic_df['Name']
# names = titanic_df.Name

In [54]:
type(names)

pandas.core.series.Series

In [56]:
name_age = titanic_df[['Name','Age']]
name_age

                                                Name   Age
0                            Braund, Mr. Owen Harris  22.0
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0
2                             Heikkinen, Miss. Laina  26.0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0
4                           Allen, Mr. William Henry  35.0
5                                   Moran, Mr. James   NaN
6                            McCarthy, Mr. Timothy J  54.0
7                     Palsson, Master. Gosta Leonard   2.0
8  Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)  27.0
9                Nasser, Mrs. Nicholas (Adele Achem)  14.0